app/controllers/issues_controller.rb

  def create
    @issue = Issue.new(params[:issue])
    respond_to do |format|
      if @issue.save
---
INSERT INTO "issues" ("title", "issue_content", "created_at", "submitted_by") VALUES ('abc', 'Issue Content', '2012-07-03T17:29:20+05:30', 'test user') RETURNING "id"